---
kind: other
id: Methods.T:Autodesk.Revit.DB.PropertyLine
source: html/d5cce77f-277b-645f-61aa-ac4f39a05a8e.htm
---
# PropertyLine Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.